МедПредыМобильные/src/Catalogs/КонтактныеЛица/КонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛица</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>СпециализацияВрача</name>
    <type>
      <types>CatalogRef.СпециализацияВрача</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

МедПредыМобильные/src/Enums/ВидыКонтрагентов/ВидыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонтрагентов</name>
  <enumValues>
    <name>ЛПУ</name>
  </enumValues>
  <enumValues>
    <name>Аптека</name>
  </enumValues>
</mdclass:Enum>

МедПредыМобильные/src/Catalogs/КонтактныеЛица/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Перем КэшНайденныхКонтактов;

#Область ОбщегоНазначения

&НаКлиенте
Процедура ПозвонитьОтправитьСМС(Схема)
	
	Если ЗначениеЗаполнено(Объект.НомерТелефона) Тогда
		ЗапуститьПриложение(Схема + СокрЛП(Объект.НомерТелефона));
	Иначе
		Предупреждение(НСтр("ru='Вначале укажите телефон!';en='First, specify the telephone!'"));
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	ОбщегоНазначенияСервер.УстановитьЗаголовокФормы(ЭтаФорма, НСтр("ru='Контактное лицо';en='Contact'"));
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандныхПанелейФормы

&НаКлиенте
Процедура Позвонить(Команда)
	
	ПозвонитьОтправитьСМС("tel:");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	
	ПозвонитьОтправитьСМС("sms:");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЭлектронноеПисьмо(Команда)
	
	Если ЗначениеЗаполнено(Объект.АдресЭП) Тогда
		ЗапуститьПриложение("mailto:"+СокрЛП(Объект.АдресЭП));
	Иначе
		Предупреждение(НСтр("ru='Вначале укажите Email!';en='First, specify the Email!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерКонтактовКлиент.ЗаполнитьСписокВыбораИзКонтактнойКниги(
		Текст,
		ДанныеВыбора,
		СтандартнаяОбработка,
		КэшНайденныхКонтактов,
		Ложь
	);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	#Если МобильноеПриложениеКлиент Тогда
		//ИспользоватьСинхронизациюСКонтактнойКнигой = ОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("ИспользоватьСинхронизациюСКонтактнойКнигой");
		ИспользоватьСинхронизациюСКонтактнойКнигой = Истина;
		Если НЕ ИспользоватьСинхронизациюСКонтактнойКнигой Тогда
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
			СтандартнаяОбработка = Ложь;
			МенеджерКонтактовКлиент.ЗаполнитьРеквизитыКонтрагента(Объект, ВыбранноеЗначение);
		КонецЕсли;
		КэшНайденныхКонтактов = Неопределено;
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбщегоНазначенияСервер.УстановитьЗаголовокФормы(ЭтаФорма, НСтр("ru='Контактное лицо';en='Contact'"));
	
КонецПроцедуры

&НаКлиенте
Процедура Справка(Команда)
	//!
	ПерейтиПоНавигационнойСсылке("http://server.prof-it.ru/redmine/projects/dfgwiki/wiki/Wiki");
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Элементы.СпециализацияВрача.Видимость = (Объект.Владелец.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЛПУ"));
КонецПроцедуры

#КонецОбласти
